// 스택 자료구조는 후입선출(LIFO, Last-In-First-Out)의 원리를 따르는 자료구조입니다. 이것은 가장 최근에 삽입된 항목이 가장 먼저 제거되는 구조를 말합니다. 주어진 코드에서는 이러한 스택의 특성을 보여주는 몇 가지 요소들이 있습니다:
// isWhat 배열: 스택으로 사용되는 배열입니다. 이 배열에는 값을 순서대로 저장하며, 가장 최근에 추가된 값은 배열의 끝에 위치하게 됩니다.
// point 변수: 스택의 상태를 나타내는 포인터입니다. point 변수는 현재 스택의 최상단을 가리키는 역할을 합니다. 즉, 스택에 값이 추가되거나 제거될 때마다 이 point 변수가 업데이트됩니다.
// into() 함수: 스택에 값을 추가하는 함수입니다. 이 함수에서는 point 변수를 증가시키면서 스택에 값을 추가합니다.
// take() 함수: 스택에서 값을 제거하고 반환하는 함수입니다. 이 함수에서는 point 변수를 감소시키면서 스택에서 값을 제거합니다.
// isEmpty() 함수: 스택이 비어있는지 확인하는 함수입니다. point 변수가 초기값인 -1일 때 스택이 비어있다고 판단합니다.
// isFull() 함수: 스택이 가득 차 있는지 확인하는 함수입니다. point 변수가 특정한 값(여기서는 MAX_SIZE - 1)일 때 스택이 가득 찼다고 판단합니다.
// 이러한 요소들을 종합해 보면, 주어진 코드는 스택 자료구조를 구현하고 이를 활용하여 값을 추가하고 제거하는 기능을 수행합니다. 따라서 이 코드는 스택 자료구조를 다루고 있다는 것을 알 수 있습니다.

#include <stdio.h>
#define MAX_SIZE 10

int isWhat[MAX_SIZE]; // 크기가 MAX_SIZE인 배열 isWhat을 선언하여 정수를 저장합니다.
int point = -1; // 스택 포인터 변수 point를 -1로 초기화합니다.

void into(int num) { // 스택에 값을 추가하는 함수 into를 정의합니다.
    if (point >= 10) // 만약 point가 10 이상이면 스택이 가득 찬 상태입니다.
        printf("Full"); // 스택이 가득 찼음을 알리는 메시지를 출력합니다.
    else 
        isWhat[++point] = num; // 그렇지 않으면 num을 스택에 추가하고 포인터를 증가시킵니다.
}

int take() { // 스택에서 값을 가져오는 함수 take를 정의합니다.
    if (isEmpty() == 1) // 만약 스택이 비어있다면
        printf("Empty"); // 스택이 비었다는 메시지를 출력합니다.
    else 
        return isWhat[point--]; // 그렇지 않으면 스택에서 값을 꺼내고 포인터를 감소시킵니다.
    return 0;
}

int isEmpty() { // 스택이 비어있는지 확인하는 함수 isEmpty를 정의합니다.
    if (point == -1) // 만약 포인터가 -1이라면 스택이 비어있는 상태입니다.
        return 1; // 1을 반환하여 스택이 비어있음을 나타냅니다.
    return 0; // 그렇지 않으면 0을 반환합니다.
}

int isFull() { // 스택이 가득 찼는지 확인하는 함수 isFull을 정의합니다.
    if (point == 10) // 만약 포인터가 10이라면 스택이 가득 찬 상태입니다.
        return 1; // 1을 반환하여 스택이 가득 찼음을 나타냅니다.
    return 0; // 그렇지 않으면 0을 반환합니다.
}

int main (int argc, char const *argv[]) { // 메인 함수를 정의합니다.
    int e; // 정수형 변수 e를 선언합니다.
    into(5); into(2); // 스택에 5와 2를 추가합니다.
    while(!isEmpty()) { // 스택이 비어있지 않은 동안 반복합니다.
        printf("%d", take()); // 스택에서 값을 꺼내서 출력합니다.
        into(4); into(1); printf("%d", take()); // 스택에 4와 1을 추가한 후 값을 꺼내서 출력합니다.
        into(3); printf("%d", take()); printf("%d", take()); // 스택에 3을 추가한 후 값을 두 번 꺼내서 출력합니다.
        into(6); printf("%d", take()); printf("%d", take()); // 스택에 6을 추가한 후 값을 두 번 꺼내서 출력합니다.
    }
    return 0; // 프로그램을 종료합니다.
}