#include <stdio.h>

int main(void) {
    int n[5];
    int i;

    for (i=0; i<5; i++) {
        printf("숫자를 입력해주세요 : ");
        scanf("%d", &n[i]);
    }

    for (i = 0; i<5; i++) {
        printf("%d", n[(i+1)%5]);

//       printf("%d", n[(i+1)%5]);는 배열 n의 요소를 순환하면서 출력하는 코드입니다.
//       여기서 n[(i+1)%5]는 배열 n의 인덱스를 지정하는 표현식입니다.
//       (i+1)%5는 현재 인덱스 i의 다음 위치를 나타냅니다.
//       %5는 배열의 크기가 5이므로, 배열의 인덱스를 순환하면서 접근하기 위해 사용됩니다.
//       i+1은 현재 인덱스의 다음 위치를 나타내므로, (i+1)%5는 현재 인덱스의 다음 위치를 배열의 범위 내에서 순환하면서 접근하는 것을 의미합니다.
//       따라서 이 코드는 현재 인덱스의 다음 위치에 있는 배열의 요소를 출력합니다. 이를 통해 배열을 순환하면서 출력하는 효과를 얻을 수 있습니다.
    }
    return 0;
}