#include <stdio.h>

// 다음은 2진수 101110을 10진수로 변환하는 C언어 프로그램이다. 프로그램을 준석하여 괄호(a~b)에 들어갈 알맞은 답을 쓰시오

int main() {
    int input = 101110;
    int di = 1;
    int sum = 0;

    while (1){
        
        if (input == 0) {
            break;
        } else {
            // input의 가장 오른쪽 자리수를 가져야하는데 이를 위해 input을 10으로 나눈 나머지를 사용하면 2진수의 가장 오른쪽 숫자를 얻을 수 있다.
            // 그래서 괄호(a)에는 %, (b)에는 10을 넣어야 함
            // di를 2배 증가시키는데, 이는 2진수의 다음 자리가 10진수로 2배 더 큰 가치를 가지기 때문
            // input을 10으로 나눠서 다음 자리수로 넘어감
            // 이는 2진수를 한자리씩 오른쪽으로 이동시키는 효과가 있음
            // 예를 들어, 101110을 10으로 나누면, 10111이 되면서 한자리 오른쪽 이동이 됨
            sum = sum + (input % 10) * di;
            di = di * 2;
            input = input / 10;
        }
    }
    
    printf("%d", sum);
}