#include <stdio.h>

// 위의 코드는 주어진 범위 내에서 완전수를 찾고 그 합을 출력하는 프로그램입니다.
// test() 함수는 주어진 수가 완전수인지를 판별하는 함수입니다.
// 입력된 수의 약수를 찾기 위해 1부터 해당 수의 절반까지 반복문을 돌며 나누어 떨어지는 수를 찾습니다.
// 이 약수들의 합이 입력된 수와 같으면 해당 수는 완전수로 판별됩니다.
// main() 함수는 2부터 100까지의 수를 순회하면서 test() 함수를 호출하여 완전수를 찾고, 그 값을 합산합니다.
// 최종적으로 합산된 완전수의 값이 출력됩니다.
// 이 프로그램은 입력된 범위 내에서 완전수를 찾아 그 합을 출력하는 기능을 수행합니다.

// test() 함수는 한 개의 정수를 매개변수로 받아 그 수가 완전수인지를 판별합니다.
// 먼저 test() 함수가 호출되면, 함수 내부에서는 두 개의 지역 변수인 i와 sum이 선언됩니다. 여기서 i는 반복문에서 사용될 변수이고, sum은 입력된 수 n의 약수의 합을 저장할 변수입니다. sum은 0으로 초기화됩니다.
// 그 다음으로 for 루프가 시작됩니다. 이 루프는 i가 1부터 n의 절반까지 1씩 증가하면서 반복됩니다.
// 루프 내에서는 if 문을 사용하여 n을 i로 나눈 나머지가 0인지를 확인합니다. 즉, i가 n의 약수인지를 검사하는 것입니다. 만약 n을 i로 나눈 나머지가 0이라면, i는 n의 약수이므로 sum에 i를 더합니다.
// 이 과정을 반복하여 for 루프가 종료될 때까지 n의 모든 약수를 찾고, 그 약수들의 합을 sum에 저장합니다.
// for 루프가 종료된 후에는 if 문을 사용하여 n과 sum이 같은지를 비교합니다. 만약 같다면, 즉 n의 약수의 합이 n과 동일하다면, 이 수는 완전수이므로 1을 반환합니다. 그렇지 않다면, 즉 완전수가 아니라면 0을 반환합니다.
// 이렇게 test() 함수는 입력된 수가 완전수인지를 판별하는 과정을 거치게 됩니다. 함수가 완전수일 경우 1을 반환하고, 그렇지 않을 경우 0을 반환하게 됩니다.

int test(int n) {
    int i, sum = 0;

    for (i=1; i<=n/2; i++) {
        if(n%i==0)
        sum +=i;
    }

    if (n == sum)
        return 1;
    return 0;
}

int main() {
    int i, sum=0;

    for (i = 2; i <=100; i++){
        if(test(i))
        sum += i;
    }

    printf("%d", sum);
    return 0;
}